ipi/tutorial/04/kubikwurzel.org
#+AUTHOR: Robin Heinemann
#+TITLE: Übungszettel 4
#+OPTIONS: toc:nil
#+OPTIONS: H:6
#+LATEX_CLASS: koma-article
#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage{siunitx}%
#+LATEX_HEADER: \usepackage{fontspec}%
#+LATEX_HEADER: \sisetup{load-configurations = abbrevations}%
#+LATEX_HEADER: \newcommand{\estimates}{\overset{\scriptscriptstyle\wedge}{=}}%
#+LATEX_HEADER: \usepackage{mathtools}%
#+LATEX_HEADER: \DeclarePairedDelimiter\abs{\lvert}{\rvert}%
#+LATEX_HEADER: \DeclarePairedDelimiter\norm{\lVert}{\rVert}%
#+LATEX_HEADER: \DeclareMathOperator{\Exists}{\exists}%
#+LATEX_HEADER: \DeclareMathOperator{\Forall}{\forall}%
#+LATEX_HEADER: \def\colvec#1{\left(\vcenter{\halign{\hfil$##$\hfil\cr \colvecA#1;;}}\right)}
#+LATEX_HEADER: \def\colvecA#1;{\if;#1;\else #1\cr \expandafter \colvecA \fi}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{makecell}
# #+LATEX_HEADER: \usemintedstyle{tango}
#+LATEX_HEADER: \usemintedstyle{perldoc}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{arrows,automata}
#+LATEX_HEADER: \usepackage{tikz-qtree}
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \setlistdepth{20}
#+LATEX_HEADER: \renewlist{itemize}{itemize}{20}
#+LATEX_HEADER: \setlist[itemize]{label=$\cdot$}

\section*{Aufgabe 4.1}
Herleitung des Newtonverfahren für Kubikwurzeln
\begin{align*}
\intertext{Es ist gegeben}
x^{(t + 1)} = x^{(t)} - \frac{f(x^{(t)})}{f'(x^{(t)})} \\
\intertext{im Fall der Kubikwurzeln gilt:}
f(x) = x^3 - y \\
f(x^\ast) = 0 \\
x^\ast = \sqrt[3]{y} \\
\intertext{Damit erhält man für $x^{(t + 1)}$:}
x^{(t + 1)} = x^{(t)} - \frac{x^{(t)^3} - y}{3x^{(t)^2}} = \frac{2x^{(t)^3} + y}{3x^{(t)^2}}
\intertext{Als Abbruchbedingung könnte man wählen:}
\abs{x^{(t)^3} - y} \leq \varepsilon
\intertext{Für ein kleines $\varepsilon$ zum Beispiel ist $\varepsilon = 10^{-15} y$ für double sinnvoll, denn diese sind nur auf genau 16 Nachkommastellen genau, also könnte eine höhere Genauigkeit mit trivialen Methoden gar nicht erreicht werden}
\end{align*}

\section*{Aufgabe 4.2b}
Herleitung von $n$ ist Quadratzahl \implies $(n \mod 4) \in \{0, 1\}$
$n$ Quadratzahl \implies $\Exists a\in \mathbb{N}: a^2 = n$
\[n \mod 4 = (a\cdot a) \mod 4 = ((a \mod 4)(a\mod 4)) \mod 4\]
Für $a \mod 4$ gibt es 4 verschiedene Fälle:
1. $a\mod 4 = 0 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 0}) \mod 4 = 0$
2. $a\mod 4 = 1 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 1}) \mod 4 = 1$
3. $a\mod 4 = 2 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 4}) \mod 4 = 0$
4. $a\mod 4 = 3 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 9}) \mod 4 = 1$
\implies $n$ Quadratzahl \implies $(n\mod 4) \in \{0, 1\}$
