ipi/tutorial/04/kubikwurzel.tex
% Created 2016-12-18 So 21:16
\documentclass[a4paper]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{siunitx}%
\usepackage{fontspec}%
\sisetup{load-configurations = abbrevations}%
\newcommand{\estimates}{\overset{\scriptscriptstyle\wedge}{=}}%
\usepackage{mathtools}%
\DeclarePairedDelimiter\abs{\lvert}{\rvert}%
\DeclarePairedDelimiter\norm{\lVert}{\rVert}%
\DeclareMathOperator{\Exists}{\exists}%
\DeclareMathOperator{\Forall}{\forall}%
\def\colvec#1{\left(\vcenter{\halign{\hfil$##$\hfil\cr \colvecA#1;;}}\right)}
\def\colvecA#1;{\if;#1;\else #1\cr \expandafter \colvecA \fi}
\usepackage{minted}
\usepackage{makecell}
\usemintedstyle{perldoc}
\usepackage{tikz}
\usetikzlibrary{arrows,automata}
\usepackage{tikz-qtree}
\usepackage{enumitem}
\setlistdepth{20}
\renewlist{itemize}{itemize}{20}
\setlist[itemize]{label=$\cdot$}
\author{Robin Heinemann}
\date{\today}
\title{Übungszettel 4}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\section*{Aufgabe 4.1}
Herleitung des Newtonverfahren für Kubikwurzeln
\begin{align*}
\intertext{Es ist gegeben}
x^{(t + 1)} = x^{(t)} - \frac{f(x^{(t)})}{f'(x^{(t)})} \\
\intertext{im Fall der Kubikwurzeln gilt:}
f(x) = x^3 - y \\
f(x^\ast) = 0 \\
x^\ast = \sqrt[3]{y} \\
\intertext{Damit erhält man für $x^{(t + 1)}$:}
x^{(t + 1)} = x^{(t)} - \frac{x^{(t)^3} - y}{3x^{(t)^2}} = \frac{2x^{(t)^3} + y}{3x^{(t)^2}}
\intertext{Als Abbruchbedingung könnte man wählen:}
\abs{x^{(t)^3} - y} \leq \varepsilon
\intertext{Für ein kleines $\varepsilon$ zum Beispiel ist $\varepsilon = 10^{-15} y$ für double sinnvoll, denn diese sind nur auf genau 16 Nachkommastellen genau, also könnte eine höhere Genauigkeit mit trivialen Methoden gar nicht erreicht werden}
\end{align*}

\section*{Aufgabe 4.2b}
Herleitung von $n$ ist Quadratzahl $\implies (n \mod 4) \in \{0, 1\}$
$n$ Quadratzahl $\implies \Exists a\in \mathbb{N}: a^2 = n$
\[n \mod 4 = (a\cdot a) \mod 4 = ((a \mod 4)(a\mod 4)) \mod 4\]
Für $a \mod 4$ gibt es 4 verschiedene Fälle:
\begin{enumerate}
\item $a\mod 4 = 0 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 0}) \mod 4 = 0$
\item $a\mod 4 = 1 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 1}) \mod 4 = 1$
\item $a\mod 4 = 2 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 4}) \mod 4 = 0$
\item $a\mod 4 = 3 \implies (\underbrace{(a\mod 4)(a\mod 4)}_{= 9}) \mod 4 = 1$
\end{enumerate}
$\implies n$ Quadratzahl $\implies (n\mod 4) \in \{0, 1\}$
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}
